/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "再試行";
CancelButtonTitle = "キャンセル";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> 原因は、以下のファイルを読み取れないことです: \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\"。";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> 以下のファイルが存在しないためです: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "\"HPEventStore.hpstore\" ファイルを移動、または削除した場合は、このファイルを戻してから [再試行] をクリックします。\r新しいファイルを作成するには、[作成] をクリックします。";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "作成";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> アプリケーションが以下のファイルにアクセスできないためです: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "アクセスの修復";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "内包しているフォルダー \"HPEventStore.hpstore\" を確認し、そのフォルダーがロックされていないこと、アクセス権限が「読み取り 書き込み」に設定されていることを確認して、[再試行] をクリックします。\rアプリケーションで権限の修復を試行するには、[アクセスの修復] をクリックします。";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION> 原因は、起動ディスクに十分な空き領域がないためです。";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "ディスクからファイルをいくつか削除して、[再試行] をクリックします。";